# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  
  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BottleNeck, 3, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BottleNeck, 4, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BottleNeck, 6, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BottleNeck, 3, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, TransformerEncoderLayer_EfficientAdditiveAttnetion, [1024]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0

  - [[4, 5, 6, 10], 1, PyramidContextExtraction, []] # 11
  - [11, 1, GetIndexOutput, [0]] # 12-P2/8
  - [11, 1, GetIndexOutput, [1]] # 13-P3/16
  - [11, 1, GetIndexOutput, [2]] # 14-P4/32
  - [11, 1, GetIndexOutput, [3]] # 15-P5/32

  - [10, 1, EUCB, []] # 16-P5/32
  - [[-1, 15], 1, FuseBlockMulti, []] # 17-P5/32

  - [6, 1, EUCB, []] # 18-P4/16
  - [[-1, 17], 1, DynamicInterpolationFusion, []] # 19-P4/16
  - [[-1, 14], 1, FuseBlockMulti, []] # 20-P4/16

  - [5, 1, EUCB, []] # 21-P3/8
  - [[-1, 20], 1, DynamicInterpolationFusion, []] # 22-P3/8
  - [[-1, 13], 1, FuseBlockMulti, []] # 23-P3/8

  - [4, 1, EUCB, []] # 24-P2/4
  - [[-1, 23], 1, DynamicInterpolationFusion, []] # 25-P2/4
  - [[-1, 12], 1, FuseBlockMulti, []] # 26-P2/4

  - [-1, 1, Conv, [256, 3, 2]] # 27-P3/8
  - [[-1, 23], 1, Concat, [1]] # 28-P3/8
  - [-1, 3, gConvC3, [256]] # 29-P3/8

  - [-1, 1, Conv, [256, 3, 2]] # 30-P4/16
  - [[-1, 20], 1, Concat, [1]] # 31-P4/16
  - [-1, 3, gConvC3, [256]] # 32-P4/16

  - [-1, 1, Conv, [256, 3, 2]] # 33-P5/32
  - [[-1, 17], 1, Concat, [1]] # 34-P5/32
  - [-1, 3, gConvC3, [256]] # 35-P5/32

  - [[26, 29, 32, 35], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)